src/DataProcessors/цур_ЗагрузкаXMLРолей/цур_ЗагрузкаXMLРолей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>цур_ЗагрузкаXMLРолей</name>
  <comment>Загружает XML ролей из каталога выгрузки конфигурации в регистр сведений цур_XMLРолейКонфигурации.</comment>
  <attributes>
    <name>КаталогВыгрузки</name>
    <comment>Путь к каталогу с выгруженной конфигурацией. Ожидается подкаталог Roles/.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/цур_XMLРолейКонфигурации/цур_XMLРолейКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_XMLРолейКонфигурации</name>
  <resources>
    <name>XMLТекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.цур_ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/цур_ЗагрузкаXMLРолей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Загружает XML всех ролей из подкаталога Roles/ указанного каталога выгрузки
// в регистр сведений цур_XMLРолейКонфигурации.
// Для каждой роли читается файл Roles/<ИмяРоли>/Ext/Rights.xml.
// Записи с пустым XML пропускаются с фиксацией в массиве ошибок.
//
// Параметры:
//  КаталогВыгрузки - Строка - путь к каталогу с выгруженной конфигурацией (содержит подкаталог Roles/)
//
// Возвращаемое значение:
//  Структура - результат операции:
//   * Успешно    - Булево  - Истина, если хотя бы одна роль загружена без критической ошибки
//   * Количество - Число   - количество успешно записанных ролей
//   * Ошибки     - Массив  - строки с описанием ошибок по отдельным ролям
//
Функция ЗагрузитьИзКаталогаВыгрузки(КаталогВыгрузки, ИнформационнаяБаза = Неопределено) Экспорт

	Результат = НовыйРезультат();

	КаталогВыгрузки = СтрЗаменить(КаталогВыгрузки, "\", "/");
	Если СтрЗаканчиваетсяНа(КаталогВыгрузки, "/") Тогда
		КаталогВыгрузки = Лев(КаталогВыгрузки, СтрДлина(КаталогВыгрузки) - 1);
	КонецЕсли;

	КаталогРолей = КаталогВыгрузки + "/Roles";

	Если НЕ КаталогСуществует(КаталогРолей) Тогда
		СообщениеОбОшибке = СтрШаблон("Каталог Roles не найден: ""%1""", КаталогРолей);
		ДобавитьОшибку(Результат, СообщениеОбОшибке);
		Возврат Результат;
	КонецЕсли;

	ОчиститьРегистрРолей(ИнформационнаяБаза);

	ФайлыXML = НайтиФайлы(КаталогРолей, "*.xml", Ложь);

	Для Каждого ФайлРоли Из ФайлыXML Цикл

		ИмяРоли = ФайлРоли.ИмяБезРасширения;
		ТекстXML = ПрочитатьRightsXML(КаталогРолей, ИмяРоли, Результат);

		Если НЕ ЗначениеЗаполнено(ТекстXML) Тогда
			Продолжить;
		КонецЕсли;

		ПараметрыЗаписи = НовыеПараметрыЗаписи();
		ПараметрыЗаписи.ИмяРоли              = ИмяРоли;
		ПараметрыЗаписи.ТекстXML             = ТекстXML;
		ПараметрыЗаписи.ИнформационнаяБаза   = ИнформационнаяБаза;

		ЗаписатьВРегистр(ПараметрыЗаписи, Результат);

	КонецЦикла;

	Результат.Успешно = (Результат.Количество > 0);
	Возврат Результат;

КонецФункции

// Выгружает роли во временный каталог через 1cv8.exe DESIGNER /DumpConfigToFiles,
// затем вызывает ЗагрузитьИзКаталогаВыгрузки и удаляет временный каталог.
// Требует доступа к файловой системе сервера и запущенного конфигуратора платформы.
//
// Параметры:
//  ПутьК1cv8    - Строка - полный путь к исполняемому файлу 1cv8.exe (или 1cv8c.exe)
//  СтрокаИБ    - Строка - строка подключения к информационной базе (/F "путь" или /S "сервер\база")
//  Пользователь - Строка - имя пользователя 1С
//  Пароль       - Строка - пароль пользователя 1С
//
// Возвращаемое значение:
//  Структура - результат операции (см. ЗагрузитьИзКаталогаВыгрузки)
//
Функция ЗагрузитьИзБазы(ПутьК1cv8, СтрокаИБ, Пользователь, Пароль, ИнформационнаяБаза = Неопределено) Экспорт

	Результат = НовыйРезультат();

	ВременныйКаталог = СоздатьВременныйКаталог(Результат);
	Если НЕ Результат.Успешно Тогда
		Возврат Результат;
	КонецЕсли;

	Результат.Успешно = Ложь;

	ВыгрузитьРолиЧерезДизайнер(
		ПутьК1cv8, СтрокаИБ, Пользователь, Пароль,
		ВременныйКаталог, Результат);

	Если Результат.Успешно Тогда
		РезультатЗагрузки = ЗагрузитьИзКаталогаВыгрузки(ВременныйКаталог, ИнформационнаяБаза);
		Результат.Количество = РезультатЗагрузки.Количество;
		Результат.Успешно    = РезультатЗагрузки.Успешно;
		Для Каждого ТекстОшибки Из РезультатЗагрузки.Ошибки Цикл
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЦикла;
	КонецЕсли;

	УдалитьКаталогРекурсивно(ВременныйКаталог);
	Возврат Результат;

КонецФункции

// Загружает XML ролей напрямую из информационной базы (справочник цур_ИнформационныеБазы).
// Выгружает роли через Designer во временный каталог, загружает в регистр и удаляет каталог.
//
// Параметры:
//  СсылкаИнформационнойБазы - СправочникСсылка.цур_ИнформационныеБазы
//
// Возвращаемое значение:
//  Структура - результат операции (см. ЗагрузитьИзКаталогаВыгрузки)
//
Функция ЗагрузитьИзИнформационнойБазы(СсылкаИнформационнойБазы) Экспорт

	РеквизитыБазы = цур_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СсылкаИнформационнойБазы,
		"АдресБазы, Пользователь, Пароль, СервернаяБаза");

	Если РеквизитыБазы = Неопределено Тогда
		Результат = НовыйРезультат();
		ДобавитьОшибку(Результат, НСтр("ru = 'Информационная база не найдена.'"));
		Возврат Результат;
	КонецЕсли;

	// TODO: передать ИнформационнаяБазу из контекста (будет сделано в PR-4)
	ПутьК1cv8 = цур_КонструкторРасширенияСервер.ПутьКПлатформе(СсылкаИнформационнойБазы);

	Если ПустаяСтрока(ПутьК1cv8) Тогда
		Результат = НовыйРезультат();
		ДобавитьОшибку(Результат, НСтр("ru = 'Не удалось определить путь к платформе 1С.'"));
		Возврат Результат;
	КонецЕсли;

	Если РеквизитыБазы.СервернаяБаза Тогда
		СтрокаИБ = СтрШаблон("/S ""%1""", РеквизитыБазы.АдресБазы);
	Иначе
		СтрокаИБ = СтрШаблон("/F ""%1""", РеквизитыБазы.АдресБазы);
	КонецЕсли;

	Возврат ЗагрузитьИзБазы(ПутьК1cv8, СтрокаИБ,
		РеквизитыБазы.Пользователь, РеквизитыБазы.Пароль, СсылкаИнформационнойБазы);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает новую пустую структуру результата.
//
// Возвращаемое значение:
//  Структура - * Успешно - Булево, * Количество - Число, * Ошибки - Массив
//
Функция НовыйРезультат()

	Результат = Новый Структура;
	Результат.Вставить("Успешно",    Ложь);
	Результат.Вставить("Количество", 0);
	Результат.Вставить("Ошибки",     Новый Массив);
	Возврат Результат;

КонецФункции

// Добавляет текст ошибки в массив ошибок результата.
//
// Параметры:
//  Результат   - Структура - структура результата
//  ТекстОшибки - Строка    - описание ошибки
//
Процедура ДобавитьОшибку(Результат, ТекстОшибки)
	Результат.Ошибки.Добавить(ТекстОшибки);
КонецПроцедуры

// Проверяет существование каталога по указанному пути.
//
// Параметры:
//  Путь - Строка - путь к каталогу
//
// Возвращаемое значение:
//  Булево
//
Функция КаталогСуществует(Путь)

	Ф = Новый Файл(Путь);
	Возврат Ф.Существует() И Ф.ЭтоКаталог();

КонецФункции

// Читает содержимое Rights.xml для указанной роли.
// Путь: <КаталогРолей>/<ИмяРоли>/Ext/Rights.xml
//
// Параметры:
//  КаталогРолей - Строка    - путь к каталогу Roles/
//  ИмяРоли     - Строка    - имя роли (без расширения .xml)
//  Результат    - Структура - структура результата для записи ошибок
//
// Возвращаемое значение:
//  Строка - содержимое файла, или пустая строка если файл не найден
//
Функция ПрочитатьRightsXML(КаталогРолей, ИмяРоли, Результат)

	//BSLLS:LatinAndCyrillicSymbolInWord-off
	ПутьKRightsXML = СтрШаблон("%1/%2/Ext/Rights.xml", КаталогРолей, ИмяРоли);
	//BSLLS:LatinAndCyrillicSymbolInWord-on

	ФайлRights = Новый Файл(ПутьKRightsXML); //BSLLS:LatinAndCyrillicSymbolInWord-off
	Если НЕ ФайлRights.Существует() Тогда //BSLLS:LatinAndCyrillicSymbolInWord-on
		СообщениеОбОшибке = СтрШаблон(
			"Роль ""%1"": файл Rights.xml не найден (%2)", ИмяРоли, ПутьKRightsXML); //BSLLS:LatinAndCyrillicSymbolInWord-off
		ДобавитьОшибку(Результат, СообщениеОбОшибке);
		Возврат "";
	КонецЕсли;

	ТекстXML = "";
	Попытка
		ЧтениеТекста = Новый ЧтениеТекста();
		ЧтениеТекста.Открыть(ПутьKRightsXML, КодировкаТекста.UTF8); //BSLLS:LatinAndCyrillicSymbolInWord-off
		ТекстXML = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();
	Исключение
		СообщениеОбОшибке = СтрШаблон(
			"Роль ""%1"": ошибка чтения Rights.xml: %2",
			ИмяРоли, цур_ОбщегоНазначения.ОписаниеОшибкиКраткое(ИнформацияОбОшибке()));
		ДобавитьОшибку(Результат, СообщениеОбОшибке);
		Возврат "";
	КонецПопытки;

	Возврат ТекстXML;

КонецФункции

// Записывает XML роли в регистр сведений цур_XMLРолейКонфигурации.
// Использует менеджер записи для атомарной перезаписи по ключу ИмяРоли.
//
// Параметры:
//  ИмяРоли  - Строка    - измерение регистра
//  ТекстXML - Строка    - содержимое Rights.xml
//  Результат - Структура - структура результата
//
// Возвращает структуру параметров для записи роли в регистр.
//
// Возвращаемое значение:
//  Структура:
//   * ИмяРоли              - Строка
//   * ТекстXML             - Строка
//   * ИнформационнаяБаза   - СправочникСсылка.цур_ИнформационныеБазы, Неопределено
//
Функция НовыеПараметрыЗаписи() Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("ИмяРоли",            "");
	Параметры.Вставить("ТекстXML",           "");
	Параметры.Вставить("ИнформационнаяБаза", Неопределено);

	Возврат Параметры;

КонецФункции

// Очищает записи регистра цур_XMLРолейКонфигурации.
// Если ИнформационнаяБаза заполнена — удаляет только записи этой ИБ.
// Если Неопределено — чистит весь регистр.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.цур_ИнформационныеБазы, Неопределено
//
Процедура ОчиститьРегистрРолей(ИнформационнаяБаза)

	НаборЗаписей = РегистрыСведений.цур_XMLРолейКонфигурации.СоздатьНаборЗаписей();

	Если ИнформационнаяБаза <> Неопределено Тогда
		НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
	КонецЕсли;

	НаборЗаписей.Записать();

КонецПроцедуры

Процедура ЗаписатьВРегистр(ПараметрыЗаписи, Результат)

	Попытка
		МенеджерЗаписи = РегистрыСведений.цур_XMLРолейКонфигурации.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяРоли  = ПараметрыЗаписи.ИмяРоли;
		МенеджерЗаписи.XMLТекст = ПараметрыЗаписи.ТекстXML;

		Если ПараметрыЗаписи.ИнформационнаяБаза <> Неопределено Тогда
			МенеджерЗаписи.ИнформационнаяБаза = ПараметрыЗаписи.ИнформационнаяБаза;
		КонецЕсли;

		МенеджерЗаписи.Записать(Истина);
		Результат.Количество = Результат.Количество + 1;
	Исключение
		СообщениеОбОшибке = СтрШаблон(
			"Роль ""%1"": ошибка записи в регистр: %2",
			ПараметрыЗаписи.ИмяРоли, цур_ОбщегоНазначения.ОписаниеОшибкиКраткое(ИнформацияОбОшибке()));
		ДобавитьОшибку(Результат, СообщениеОбОшибке);
	КонецПопытки;

КонецПроцедуры

// Создаёт временный каталог для выгрузки конфигурации.
// При ошибке фиксирует её в структуре результата.
//
// Параметры:
//  Результат - Структура - структура результата
//
// Возвращаемое значение:
//  Строка - путь к созданному каталогу (с разделителем /), или пустая строка при ошибке
//
Функция СоздатьВременныйКаталог(Результат)

	ВременныйКаталог = "";
	Попытка
		ИмяФайла = ПолучитьИмяВременногоФайла();
		УдалитьФайлы(ИмяФайла);
		ВременныйКаталог = СтрЗаменить(ИмяФайла, "\", "/");
		СоздатьКаталог(ВременныйКаталог);
		Результат.Успешно = Истина;
	Исключение
		СообщениеОбОшибке = СтрШаблон(
			"Не удалось создать временный каталог: %1",
			цур_ОбщегоНазначения.ОписаниеОшибкиКраткое(ИнформацияОбОшибке()));
		ДобавитьОшибку(Результат, СообщениеОбОшибке);
		Возврат "";
	КонецПопытки;

	Возврат ВременныйКаталог;

КонецФункции

// Выгружает только роли из целевой базы через Designer.
//
// Параметры:
//  ПутьК1cv8        - Строка    - путь к исполняемому файлу платформы
//  СтрокаИБ        - Строка    - строка подключения к ИБ
//  Пользователь    - Строка    - имя пользователя
//  Пароль          - Строка    - пароль
//  КаталогВыгрузки - Строка    - каталог назначения
//  Результат       - Структура - структура результата
//
Процедура ВыгрузитьРолиЧерезДизайнер(
		ПутьК1cv8, СтрокаИБ, Пользователь, Пароль,
		КаталогВыгрузки, Результат)

	ЧастиКоманды = Новый Массив;
	ЧастиКоманды.Добавить(СтрШаблон("""%1""", ПутьК1cv8));
	ЧастиКоманды.Добавить(СтрШаблон("DESIGNER %1", СтрокаИБ));

	Если ЗначениеЗаполнено(Пользователь) Тогда
		ЧастиКоманды.Добавить(СтрШаблон("/N""%1""", Пользователь));
	КонецЕсли;

	Если ЗначениеЗаполнено(Пароль) Тогда
		ЧастиКоманды.Добавить(СтрШаблон("/P""%1""", Пароль));
	КонецЕсли;

	ЧастиКоманды.Добавить("/DisableStartupMessages");
	ЧастиКоманды.Добавить("/DisableStartupDialogs");
	ЧастиКоманды.Добавить(СтрШаблон("/DumpConfigToFiles ""%1""", КаталогВыгрузки));

	СтрокаЗапуска = СтрСоединить(ЧастиКоманды, " ");

	КодВозврата = Неопределено;
	//BSLLS:ExternalAppStarting-off
	ЗапуститьПриложение(СтрокаЗапуска, , Истина, КодВозврата);
	//BSLLS:ExternalAppStarting-on

	Если КодВозврата = Неопределено Или КодВозврата <> 0 Тогда
		ДобавитьОшибку(Результат, СтрШаблон(
			НСтр("ru = 'Ошибка выгрузки ролей из базы (код %1).'"), КодВозврата));
		Результат.Успешно = Ложь;
		Возврат;
	КонецЕсли;

	Результат.Успешно = Истина;

КонецПроцедуры

// Рекурсивно удаляет каталог и все его содержимое.
// Ошибки удаления не являются критическими и не прерывают работу.
//
// Параметры:
//  Путь - Строка - путь к каталогу
//
Процедура УдалитьКаталогРекурсивно(Путь)

	Попытка
		УдалитьФайлы(Путь, "*");
		УдалитьФайлы(Путь);
	Исключение
		// Не критично: временный каталог будет убран ОС при следующей очистке
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
